{
  "kind": "build_request",
  "title": "Add Bitcoin (BTC) address as a donation option on the landing page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Update the “Get Involved” section so the “Donate” option includes a Bitcoin (BTC) donation address as an additional donation method, displayed on the website.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add btc address to donation option"
        ]
      },
      "acceptanceCriteria": [
        "On the landing page, the “Get Involved” section’s “Donate” option reveals BTC donation details (at minimum: a clearly labeled BTC address) in a way that is visible and readable on both mobile and desktop.",
        "The BTC address is presented as copyable text (e.g., with a “Copy address” control) and provides user feedback after copying (e.g., “Copied”).",
        "If a BTC address value is not yet configured in code, the UI does not display an invalid address; it shows a clear fallback message indicating the BTC address is not available yet."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add an optional BTC QR code presentation for the configured BTC address within the donation UI (generated client-side) and ensure the donation UI is accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add btc address to donation option"
        ]
      },
      "acceptanceCriteria": [
        "When a BTC address is configured, the donation UI includes a scannable QR code representation of the BTC address (client-generated; no backend dependency).",
        "All interactive elements in the donation UI are keyboard accessible and have appropriate accessible names/labels (e.g., for the copy control and any open/close controls if a modal/expander is used).",
        "No backend canister changes are required to display the BTC donation information."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not route any images through the backend canister."
  ],
  "nonGoals": [
    "Implementing payment processing, checkout flows, or transaction verification.",
    "Adding third-party donation providers, crypto wallet integrations, or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}