{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "BTC donation option in Get Involved section",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Display a BTC donation address under the landing page “Get Involved” → “Donate” option with copy-to-clipboard and a safe fallback when not configured.",
      "acceptanceCriteria": [
        "On the landing page, the “Get Involved” section’s “Donate” option reveals BTC donation details (at minimum: a clearly labeled BTC address) in a way that is visible and readable on both mobile and desktop.",
        "The BTC address is presented as copyable text (e.g., with a “Copy address” control) and provides user feedback after copying (e.g., “Copied”).",
        "If a BTC address value is not yet configured in code, the UI does not display an invalid address; it shows a clear fallback message indicating the BTC address is not available yet."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/donations.ts",
          "operation": "create",
          "description": "Add a small frontend configuration module for donation-related values (including an optional BTC address), allowing the UI to cleanly detect “not configured yet” and render a fallback message."
        },
        {
          "path": "frontend/src/components/BtcDonationDetails.tsx",
          "operation": "create",
          "description": "Create a reusable BTC donation details component that renders: a clearly labeled BTC address (or fallback message), a copy-to-clipboard control with post-copy feedback state, and responsive layout for mobile/desktop."
        },
        {
          "path": "frontend/src/components/GetInvolved.tsx",
          "operation": "modify",
          "description": "Update the “Donate” card to reveal BTC donation details on user interaction (e.g., accessible expander/inline panel), wiring in BtcDonationDetails and ensuring the content is readable on mobile and desktop."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Provide an optional client-generated QR code for the configured BTC address and ensure the donation UI interactions are accessible by keyboard and screen readers.",
      "acceptanceCriteria": [
        "When a BTC address is configured, the donation UI includes a scannable QR code representation of the BTC address (client-generated; no backend dependency).",
        "All interactive elements in the donation UI are keyboard accessible and have appropriate accessible names/labels (e.g., for the copy control and any open/close controls if a modal/expander is used).",
        "No backend canister changes are required to display the BTC donation information."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/btcQr.ts",
          "operation": "create",
          "description": "Implement a lightweight client-side QR generation helper for the BTC address (no backend dependency), returning a renderable representation (e.g., SVG path data or canvas draw routine) suitable for use in React."
        },
        {
          "path": "frontend/src/components/BtcDonationDetails.tsx",
          "operation": "modify",
          "description": "Enhance the BTC donation details UI to optionally render a scannable QR code when an address is configured, and ensure all controls (copy, show/hide QR, expand/collapse) have keyboard support and accessible names/labels."
        },
        {
          "path": "frontend/src/components/GetInvolved.tsx",
          "operation": "modify",
          "description": "Ensure the updated Donate interaction pattern (expander/modal/inline panel) supports full keyboard navigation (open/close via keyboard, focus order), and provides accessible labeling for the donation controls."
        }
      ]
    }
  ]
}